--TRUNCATE TABLE "Bookings" RESTART identity CASCADE;

INSERT INTO public."Bookings" (user_id, showtime_id, booking_time) values
(1, 1, '2025-01-07 09:45:00'), -- Алексей Смирнов бронирует сеанс The Shawshank Redemption в Большом зале
(2, 1, '2025-01-07 09:50:00'), -- Борис Иванов бронирует сеанс The Shawshank Redemption в Большом зале
(3, 1, '2025-01-07 09:55:00'), -- Владимир Кузнецов бронирует сеанс The Shawshank Redemption в Большом зале
(4, 1, '2025-01-07 10:00:00'), -- Дмитрий Новиков бронирует сеанс The Shawshank Redemption в Большом зале
(5, 2, '2025-01-07 13:00:00'), -- Екатерина Соколова бронирует сеанс The Godfather в Большом зале
(6, 2, '2025-01-07 13:05:00'), -- Фёдор Михайлов бронирует сеанс The Godfather в Большом зале
(7, 2, '2025-01-07 13:10:00'), -- Галина Белова бронирует сеанс The Godfather в Большом зале
(8, 3, '2025-01-07 16:30:00'), -- Иван Николаев бронирует сеанс The Dark Knight в Большом зале
(9, 3, '2025-01-07 16:35:00'), -- Жанна Попова бронирует сеанс The Dark Knight в Большом зале
(10, 3, '2025-01-07 16:40:00'), -- Кирилл Васильев бронирует сеанс The Dark Knight в Большом зале
(11, 4, '2025-01-07 19:30:00'), -- Людмила Петрова бронирует сеанс Pulp Fiction в Большом зале
(12, 4, '2025-01-07 19:35:00'), -- Мария Семёнова бронирует сеанс Pulp Fiction в Большом зале
(13, 4, '2025-01-07 19:40:00'), -- Николай Орлов бронирует сеанс Pulp Fiction в Большом зале
(14, 4, '2025-01-07 19:45:00'), -- Ольга Андреева бронирует сеанс Pulp Fiction в Большом зале
(15, 5, '2025-01-07 22:30:00'), -- Павел Павлов бронирует сеанс Forrest Gump в Большом зале
(16, 5, '2025-01-07 22:35:00'), -- Роман Зайцев бронирует сеанс Forrest Gump в Большом зале
(17, 6, '2025-01-07 10:30:00'), -- Светлана Макарова бронирует сеанс Inception в Малом зале
(18, 6, '2025-01-07 10:35:00'), -- Татьяна Григорьева бронирует сеанс Inception в Малом зале
(19, 6, '2025-01-07 10:40:00'), -- Ульяна Морозова бронирует сеанс Inception в Малом зале
(20, 6, '2025-01-07 10:45:00'), -- Филипп Крылов бронирует сеанс Inception в Малом зале
(21, 7, '2025-01-07 14:00:00'), -- Яна Егорова бронирует сеанс Fight Club в Малом зале
(22, 7, '2025-01-07 14:05:00'), -- Андрей Матвеев бронирует сеанс Fight Club в Малом зале
(23, 7, '2025-01-07 14:10:00'), -- Алексей Смирнов бронирует сеанс Fight Club в Малом зале
(24, 8, '2025-01-07 16:30:00'), -- Борис Иванов бронирует сеанс The Matrix в Малом зале
(25, 8, '2025-01-07 16:35:00'), -- Владимир Кузнецов бронирует сеанс The Matrix в Малом зале
(26, 8, '2025-01-07 16:40:00'), -- Дмитрий Новиков бронирует сеанс The Matrix в Малом зале
(27, 9, '2025-01-07 19:30:00'), -- Екатерина Соколова бронирует сеанс Goodfellas в Малом зале
(28, 9, '2025-01-07 19:35:00'), -- Фёдор Михайлов бронирует сеанс Goodfellas в Малом зале
(29, 9, '2025-01-07 19:40:00'), -- Галина Белова бронирует сеанс Goodfellas в Малом зале
(30, 10, '2025-01-07 22:30:00'), -- Иван Николаев бронирует сеанс Se7en в Малом зале
(31, 10, '2025-01-07 22:35:00'), -- Жанна Попова бронирует сеанс Se7en в Малом зале
(32, 10, '2025-01-07 22:40:00'), -- Кирилл Васильев бронирует сеанс Se7en в Малом зале
(33, 11, '2025-01-07 11:30:00'), -- Людмила Петрова бронирует сеанс The Silence of the Lambs в VIP-зале
(34, 11, '2025-01-07 11:35:00'), -- Мария Семёнова бронирует сеанс The Silence of the Lambs в VIP-зале
(35, 12, '2025-01-07 15:00:00'), -- Николай Орлов бронирует сеанс Schindler's List в VIP-зале
(36, 12, '2025-01-07 15:05:00'), -- Ольга Андреева бронирует сеанс Schindler's List в VIP-зале
(37, 12, '2025-01-07 15:10:00'), -- Павел Павлов бронирует сеанс Schindler's List в VIP-зале
(38, 13, '2025-01-07 18:30:00'), -- Роман Зайцев бронирует сеанс The Lord of the Rings: The Fellowship of the Ring в VIP-зале
(39, 13, '2025-01-07 18:35:00'), -- Светлана Макарова бронирует сеанс The Lord of the Rings: The Fellowship of the Ring в VIP-зале
(40, 14, '2025-01-07 21:30:00'), -- Татьяна Григорьева бронирует сеанс Star Wars: Episode V - The Empire Strikes Back в VIP-зале
(41, 14, '2025-01-07 21:35:00'), -- Ульяна Морозова бронирует сеанс Star Wars: Episode V - The Empire Strikes Back в VIP-зале
(42, 14, '2025-01-07 21:40:00'), -- Филипп Крылов бронирует сеанс Star Wars: Episode V - The Empire Strikes Back в VIP-зале
(43, 15, '2025-01-08 00:30:00'), -- Христина Лебедева бронирует сеанс The Avengers в VIP-зале
(44, 15, '2025-01-08 00:35:00'), -- Юрий Сидоров бронирует сеанс The Avengers в VIP-зале
(45, 15, '2025-01-08 00:40:00'), -- Яна Егорова бронирует сеанс The Avengers в VIP-зале
(46, 16, '2025-01-07 10:00:00'), -- Семён Яковлев бронирует сеанс Titanic в Детском зале
(47, 16, '2025-01-07 10:05:00'); -- Диана Воробьёва бронирует сеанс Titanic в Детском зале
