--TRUNCATE TABLE "Halls" RESTART identity CASCADE;

INSERT INTO public."Halls" ("name", capacity, description)
VALUES
('Большой зал', 120, 'Самый крупный зал с современным оборудованием и звуковой системой Dolby Atmos.'),
('Малый зал', 50, 'Уютный зал для небольших компаний, оснащённый комфортными креслами.'),
('VIP-зал', 20, 'Зал премиум-класса с кожаными креслами, индивидуальными столиками и обслуживанием.'),
('Детский зал', 40, 'Зал для семейного отдыха с мягкими креслами и ярким интерьером.'),
('Классический зал', 80, 'Традиционный зал с удобным расположением кресел и хорошей акустикой.');