-- Сеансы для Большого зала
INSERT INTO public."Showtimes" (movie_id, hall_id, start_time, end_time, price) VALUES
(1, 1, '2025-01-07 10:00:00', '2025-01-07 12:22:00', 350.00), -- The Shawshank Redemption
(2, 1, '2025-01-07 13:30:00', '2025-01-07 16:25:00', 400.00), -- The Godfather
(3, 1, '2025-01-07 17:00:00', '2025-01-07 19:32:00', 400.00), -- The Dark Knight
(4, 1, '2025-01-07 20:00:00', '2025-01-07 22:34:00', 350.00), -- Pulp Fiction
(5, 1, '2025-01-07 23:00:00', '2025-01-08 01:22:00', 300.00); -- Forrest Gump

-- Сеансы для Малого зала
INSERT INTO public."Showtimes" (movie_id, hall_id, start_time, end_time, price) VALUES
(6, 2, '2025-01-07 11:00:00', '2025-01-07 13:28:00', 250.00), -- Inception
(7, 2, '2025-01-07 14:30:00', '2025-01-07 16:49:00', 250.00), -- Fight Club
(8, 2, '2025-01-07 17:30:00', '2025-01-07 19:06:00', 250.00), -- The Matrix
(9, 2, '2025-01-07 20:00:00', '2025-01-07 22:05:00', 250.00), -- Goodfellas
(10, 2, '2025-01-07 23:00:00', '2025-01-08 00:47:00', 250.00); -- Se7en

-- Сеансы для VIP-зала
INSERT INTO public."Showtimes" (movie_id, hall_id, start_time, end_time, price) VALUES
(11, 3, '2025-01-07 12:00:00', '2025-01-07 14:00:00', 600.00), -- The Silence of the Lambs
(12, 3, '2025-01-07 15:30:00', '2025-01-07 18:05:00', 700.00), -- Schindler's List
(13, 3, '2025-01-07 19:00:00', '2025-01-07 21:18:00', 700.00), -- The Lord of the Rings: The Fellowship of the Ring
(14, 3, '2025-01-07 22:00:00', '2025-01-08 00:10:00', 600.00), -- Star Wars: Episode V - The Empire Strikes Back
(15, 3, '2025-01-08 01:00:00', '2025-01-08 03:23:00', 600.00); -- The Avengers

-- Сеансы для Детского зала
INSERT INTO public."Showtimes" (movie_id, hall_id, start_time, end_time, price) VALUES
(16, 4, '2025-01-07 11:00:00', '2025-01-07 12:28:00', 150.00), -- Titanic
(17, 4, '2025-01-07 13:00:00', '2025-01-07 14:07:00', 150.00), -- Jurassic Park
(18, 4, '2025-01-07 15:00:00', '2025-01-07 16:28:00', 150.00), -- The Lion King
(19, 4, '2025-01-07 17:00:00', '2025-01-07 18:37:00', 150.00), -- Gladiator
(20, 4, '2025-01-07 19:00:00', '2025-01-07 21:05:00', 150.00); -- The Departed

-- Сеансы для Классического зала
INSERT INTO public."Showtimes" (movie_id, hall_id, start_time, end_time, price) VALUES
(21, 5, '2025-01-07 10:30:00', '2025-01-07 12:49:00', 250.00), -- The Wolf of Wall Street
(22, 5, '2025-01-07 13:30:00', '2025-01-07 15:30:00', 250.00), -- Avatar
(23, 5, '2025-01-07 16:00:00', '2025-01-07 17:48:00', 250.00), -- The Social Network
(24, 5, '2025-01-07 18:30:00', '2025-01-07 20:09:00', 250.00), -- The Grand Budapest Hotel
(25, 5, '2025-01-07 21:00:00', '2025-01-07 23:09:00', 250.00); -- Interstellar